[
  {
    "id": "q1",
    "question": "List all boardgames by GMT.",
    "sparql_wrong": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT ?uri WHERE { ?uri dbo:author res:GMT_Games }",
    "sparql_gold": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT ?uri WHERE { ?uri dbo:publisher res:GMT_Games }",
    "error_types": [
      "semantic"
    ],
    "sub_error_types": [
      "incorrect property"
    ]
  },
  {
    "id": "q9",
    "question": "Give me all actors starring in movies directed by and starring William Shatner.",
    "sparql_wrong": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ?uri WHERE { { ?x dbo:director res:William_Shatner ; dbo:starring res:William_Shatner . { ?x dbo:producer ?uri } UNION { ?x dbp:starring ?uri } } }",
    "sparql_gold": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ?uri WHERE { ?x dbo:director res:William_Shatner ; dbo:starring res:William_Shatner { ?x dbo:starring ?uri } UNION { ?x dbp:starring ?uri } }",
    "error_types": [
      "semantic"
    ],
    "sub_error_types": [
      "incorrect property"
    ]
  },
  {
    "id": "q11",
    "question": "Give me all Danish films.",
    "sparql_wrong": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { res:Denmark dbo:country ?uri . ?uri rdf:type dbo:Film }",
    "sparql_gold": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Film ; dbo:country res:Denmark }",
    "error_types": [
      "structural"
    ],
    "sub_error_types": [
      "triple flip (subject/object inversion)"
    ]
  },
  {
    "id": "q13",
    "question": "Give me the grandchildren of Bruce Lee.",
    "sparql_wrong": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Bruce_Lee dbo:child ?child . ?child <http://dbpedia.org/property/children> ?uri }",
    "sparql_gold": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Bruce_Lee dbo:child ?child . ?child <http://dbpedia.org/property/children> ?uri }",
    "error_types": [
      "syntax"
    ],
    "sub_error_types": [
      "missing or mismatched braces"
    ]
  },
  {
    "id": "q20",
    "question": "Give me the Apollo 14 astronauts.",
    "sparql_wrong": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:mission res:Apollo_13 }",
    "sparql_gold": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:mission res:Apollo_14 }",
    "error_types": [
      "semantic"
    ],
    "sub_error_types": [
      "wrong literal or resource type"
    ]
  },
  {
    "id": "q24",
    "question": "Give me a list of all trumpet players that were bandleaders.",
    "sparql_wrong": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:occupation res:Bandleader ; dbo:instrument res:Saxophone }",
    "sparql_gold": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:occupation res:Bandleader ; dbo:instrument res:Trumpet }",
    "error_types": [
      "semantic"
    ],
    "sub_error_types": [
      "wrong literal or resource type"
    ]
  },
  {
    "id": "q29",
    "question": "Show me all museums in London.",
    "sparql_wrong": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Person> ; <http://dbpedia.org/ontology/location> <http://dbpedia.org/resource/London> }",
    "sparql_gold": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Museum> ; <http://dbpedia.org/ontology/location> <http://dbpedia.org/resource/London> }",
    "error_types": [
      "semantic"
    ],
    "sub_error_types": [
      "incorrect class"
    ]
  },
  {
    "id": "q33",
    "question": "Give me all writers that won the Nobel Prize in literature.",
    "sparql_wrong": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Book> ; <http://dbpedia.org/ontology/award> <http://dbpedia.org/resource/Nobel_Prize_in_Literature> }",
    "sparql_gold": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Writer> ; <http://dbpedia.org/ontology/award> <http://dbpedia.org/resource/Nobel_Prize_in_Literature> }",
    "error_types": [
      "semantic"
    ],
    "sub_error_types": [
      "incorrect class"
    ]
  },
  {
    "id": "q34",
    "question": "Show me all basketball players that are higher than 2 meters.",
    "sparql_wrong": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/BasketballPlayer> ; <http://dbpedia.org/ontology/weight> ?n FILTER ( ?n > 2.0 ) }",
    "sparql_gold": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/BasketballPlayer> ; <http://dbpedia.org/ontology/height> ?n FILTER ( ?n > 2.0 ) }",
    "error_types": [
      "semantic"
    ],
    "sub_error_types": [
      "incorrect property"
    ]
  },
  {
    "id": "q40",
    "question": "Give all swimmers that were born in Moscow.",
    "sparql_wrong": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Swimmer> ; <http://dbpedia.org/ontology/deathPlace> <http://dbpedia.org/resource/Moscow> }",
    "sparql_gold": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Swimmer> ; <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Moscow> }",
    "error_types": [
      "semantic"
    ],
    "sub_error_types": [
      "incorrect property"
    ]
  },
  {
    "id": "q46",
    "question": "Show a list of soccer clubs that play in the Bundesliga.",
    "sparql_wrong": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/BasketballTeam> ; <http://dbpedia.org/ontology/league> <http://dbpedia.org/resource/Bundesliga> }",
    "sparql_gold": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/SoccerClub> ; <http://dbpedia.org/ontology/league> <http://dbpedia.org/resource/Bundesliga> }",
    "error_types": [
      "semantic"
    ],
    "sub_error_types": [
      "incorrect class"
    ]
  },
  {
    "id": "q51",
    "question": "Give me all Danish movies.",
    "sparql_wrong": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Book> ; <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Denmark> }",
    "sparql_gold": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Film> ; <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Denmark> }",
    "error_types": [
      "semantic"
    ],
    "sub_error_types": [
      "incorrect class"
    ]
  },
  {
    "id": "q55",
    "question": "Give me the capitals of all countries that the Himalayas run through.",
    "sparql_wrong": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Himalayas> <http://dbpedia.org/ontology/country> ?country . ?country <http://dbpedia.org/ontology/birthPlace> ?uri }",
    "sparql_gold": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Himalayas> <http://dbpedia.org/ontology/country> ?country . ?country <http://dbpedia.org/ontology/capital> ?uri }",
    "error_types": [
      "semantic"
    ],
    "sub_error_types": [
      "incorrect property"
    ]
  },
  {
    "id": "q59",
    "question": "Give me all islands that belong to Japan.",
    "sparql_wrong": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Island> ; <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Japan> }",
    "sparql_gold": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Island> ; <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Japan> }",
    "error_types": [
      "syntax"
    ],
    "sub_error_types": [
      "missing or mismatched braces"
    ]
  },
  {
    "id": "q61",
    "question": "Give me all Apollo 14 astronauts.",
    "sparql_wrong": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/spaceStation> <http://dbpedia.org/resource/Apollo_14> }",
    "sparql_gold": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/mission> <http://dbpedia.org/resource/Apollo_14> }",
    "error_types": [
      "semantic"
    ],
    "sub_error_types": [
      "incorrect property"
    ]
  },
  {
    "id": "q64",
    "question": "Give me all soccer clubs in the Premier League.",
    "sparql_wrong": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/SoccerClub> ; <http://dbpedia.org/ontology/league> <http://dbpedia.org/resource/Premier_League> }",
    "sparql_gold": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/SoccerClub> ; <http://dbpedia.org/ontology/league> <http://dbpedia.org/resource/Premier_League> }",
    "error_types": [
      "syntax"
    ],
    "sub_error_types": [
      "missing or mismatched braces"
    ]
  },
  {
    "id": "q73",
    "question": "Give me all ESA astronauts.",
    "sparql_wrong": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Scientist> ; <http://dbpedia.org/property/type> <http://dbpedia.org/resource/European_Space_Agency> }",
    "sparql_gold": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Astronaut> ; <http://dbpedia.org/property/type> <http://dbpedia.org/resource/European_Space_Agency> }",
    "error_types": [
      "semantic"
    ],
    "sub_error_types": [
      "incorrect class"
    ]
  },
  {
    "id": "q86",
    "question": "Give me all actors who were born in Berlin.",
    "sparql_wrong": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Film> ; <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Berlin> }",
    "sparql_gold": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Actor> ; <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Berlin> }",
    "error_types": [
      "semantic"
    ],
    "sub_error_types": [
      "incorrect class"
    ]
  },
  {
    "id": "q87",
    "question": "Who created Goofy?",
    "sparql_wrong": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Goofy> <http://dbpedia.org/ontology/author> ?uri }",
    "sparql_gold": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Goofy> <http://dbpedia.org/ontology/creator> ?uri }",
    "error_types": [
      "semantic"
    ],
    "sub_error_types": [
      "incorrect property"
    ]
  },
  {
    "id": "q91",
    "question": "Give me all the TV shows with Neil Patrick Harris.",
    "sparql_wrong": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Film> ; <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Neil_Patrick_Harris> }",
    "sparql_gold": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/TelevisionShow> ; <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Neil_Patrick_Harris> }",
    "error_types": [
      "semantic"
    ],
    "sub_error_types": [
      "incorrect class"
    ]
  },
  {
    "id": "q94",
    "question": "Give me all Swedish holidays.",
    "sparql_wrong": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Holiday> ; <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Norway> }",
    "sparql_gold": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Holiday> ; <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Sweden> }",
    "error_types": [
      "semantic"
    ],
    "sub_error_types": [
      "wrong literal or resource type"
    ]
  },
  {
    "id": "q96",
    "question": "List all the musicals with music by Leonard Bernstein.",
    "sparql_wrong": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Musical> ; <http://dbpedia.org/ontology/musicBy> <http://dbpedia.org/resource/Leonard_Bernstein> ",
    "sparql_gold": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Musical> ; <http://dbpedia.org/ontology/musicBy> <http://dbpedia.org/resource/Leonard_Bernstein> }",
    "error_types": [
      "syntax"
    ],
    "sub_error_types": [
      "missing or mismatched braces"
    ]
  },
  {
    "id": "q103",
    "question": "Give me all types of eating disorders.",
    "sparql_wrong": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/class/yago/WikicatMoodDisorders> }",
    "sparql_gold": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/class/yago/WikicatEatingDisorders> }",
    "error_types": [
      "semantic"
    ],
    "sub_error_types": [
      "incorrect class"
    ]
  },
  {
    "id": "q109",
    "question": "Give me all books written by Danielle Steel.",
    "sparql_wrong": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Film> ; <http://dbpedia.org/ontology/author> <http://dbpedia.org/resource/Danielle_Steel> }",
    "sparql_gold": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Book> ; <http://dbpedia.org/ontology/author> <http://dbpedia.org/resource/Danielle_Steel> }",
    "error_types": [
      "semantic"
    ],
    "sub_error_types": [
      "incorrect class"
    ]
  },
  {
    "id": "q113",
    "question": "Give me all libraries established earlier than 1400.",
    "sparql_wrong": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Library> ; <http://dbpedia.org/property/birthDate> ?year FILTER ( ?year < 1400 ) }",
    "sparql_gold": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Library> ; <http://dbpedia.org/property/established> ?year FILTER ( ?year < 1400 ) }",
    "error_types": [
      "semantic"
    ],
    "sub_error_types": [
      "incorrect property"
    ]
  },
  {
    "id": "q118",
    "question": "Give me all Methodist politicians.",
    "sparql_wrong": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Artist> ; <http://dbpedia.org/ontology/religion> <http://dbpedia.org/resource/Methodism> }",
    "sparql_gold": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Politician> ; <http://dbpedia.org/ontology/religion> <http://dbpedia.org/resource/Methodism> }",
    "error_types": [
      "semantic"
    ],
    "sub_error_types": [
      "incorrect class"
    ]
  },
  {
    "id": "q141",
    "question": "Give me the birthdays of all actors of the television show Charmed.",
    "sparql_wrong": "SELECT DISTINCT ?date WHERE { <http://dbpedia.org/resource/Charmed> <http://dbpedia.org/ontology/starring> ?actor . ?actor <http://dbpedia.org/ontology/deathDate> ?date }",
    "sparql_gold": "SELECT DISTINCT ?date WHERE { <http://dbpedia.org/resource/Charmed> <http://dbpedia.org/ontology/starring> ?actor . ?actor <http://dbpedia.org/ontology/birthDate> ?date }",
    "error_types": [
      "semantic"
    ],
    "sub_error_types": [
      "incorrect property"
    ]
  },
  {
    "id": "q143",
    "question": "Give me a list of all lakes in Denmark.",
    "sparql_wrong": "SELECT DISTINCT ?uri WHERE {{ {{ <http://dbpedia.org/resource/Denmark> <http://dbpedia.org/ontology/country> ?uri ; a <http://dbpedia.org/ontology/Lake> }} UNION {{ ?uri a <http://dbpedia.org/class/yago/LakesOfDenmark> }} }}",
    "sparql_gold": "SELECT DISTINCT ?uri WHERE { { ?uri a <http://dbpedia.org/ontology/Lake> ; <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Denmark> } UNION { ?uri a <http://dbpedia.org/class/yago/LakesOfDenmark> } }",
    "error_types": [
      "structural"
    ],
    "sub_error_types": [
      "triple flip (subject/object inversion)"
    ]
  },
  {
    "id": "q158",
    "question": "List all episodes of the first season of the HBO television series The Sopranos!",
    "sparql_wrong": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:series res:The_Sopranos ; dbo:seasonNumber \"1\" }",
    "sparql_gold": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:series res:The_Sopranos ; dbo:seasonNumber 1 }",
    "error_types": [
      "semantic"
    ],
    "sub_error_types": [
      "wrong literal or resource type"
    ]
  },
  {
    "id": "q161",
    "question": "Give me all films produced by Hal Roach.",
    "sparql_wrong": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Film> ; <http://dbpedia.org/ontology/producer> <http://dbpedia.org/resource/Hal_Roach> }",
    "sparql_gold": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Film> ; <http://dbpedia.org/ontology/producer> <http://dbpedia.org/resource/Hal_Roach> }",
    "error_types": [
      "syntax"
    ],
    "sub_error_types": [
      "missing or mismatched braces"
    ]
  },
  {
    "id": "q164",
    "question": "Give me a list of all bandleaders that play trumpet.",
    "sparql_wrong": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/Bandleader> ; <http://dbpedia.org/ontology/instrument> <http://dbpedia.org/resource/Trumpet> }",
    "sparql_gold": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/Bandleader> ; <http://dbpedia.org/ontology/instrument> <http://dbpedia.org/resource/Trumpet> }",
    "error_types": [
      "syntax"
    ],
    "sub_error_types": [
      "missing or mismatched braces"
    ]
  },
  {
    "id": "q171",
    "question": "Give me all movies with Tom Cruise.",
    "sparql_wrong": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Film> ; <http://dbpedia.org/ontology/director> <http://dbpedia.org/resource/Tom_Cruise> }",
    "sparql_gold": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Film> ; <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Tom_Cruise> }",
    "error_types": [
      "semantic"
    ],
    "sub_error_types": [
      "incorrect property"
    ]
  },
  {
    "id": "q173",
    "question": "Give me all cities in New Jersey with more than 100000 inhabitants.",
    "sparql_wrong": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:City ; dbo:isPartOf res:New_Jersey ; dbo:populationTotal ?inhabitants FILTER ( ?inhabitants > 100000 ) }",
    "sparql_gold": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:City ; dbo:isPartOf res:New_Jersey ; dbo:populationTotal ?inhabitants FILTER ( ?inhabitants > 100000 ) }",
    "error_types": [
      "syntax"
    ],
    "sub_error_types": [
      "missing or mismatched braces"
    ]
  },
  {
    "id": "q175",
    "question": "Give me all B-sides of the Ramones.",
    "sparql_wrong": "SELECT DISTINCT ?string WHERE {{ ?x <http://dbpedia.org/ontology/musicalArtist> <http://dbpedia.org/resource/Ramones> ; <http://dbpedia.org/ontology/aSide> ?string }}",
    "sparql_gold": "SELECT DISTINCT ?string WHERE { ?x <http://dbpedia.org/ontology/musicalArtist> <http://dbpedia.org/resource/Ramones> ; <http://dbpedia.org/ontology/bSide> ?string }",
    "error_types": [
      "semantic"
    ],
    "sub_error_types": [
      "incorrect property"
    ]
  },
  {
    "id": "q178",
    "question": "List the seven kings of Rome.",
    "sparql_wrong": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/property/title> <http://dbpedia.org/resource/Queen_of_Rome> }",
    "sparql_gold": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/property/title> <http://dbpedia.org/resource/King_of_Rome> }",
    "error_types": [
      "semantic"
    ],
    "sub_error_types": [
      "wrong literal or resource type"
    ]
  },
  {
    "id": "q179",
    "question": "Give me all people that were born in Vienna and died in Berlin.",
    "sparql_wrong": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Vienna> ; <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Berlin> }",
    "sparql_gold": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Vienna> ; <http://dbpedia.org/ontology/deathPlace> <http://dbpedia.org/resource/Berlin> }",
    "error_types": [
      "semantic"
    ],
    "sub_error_types": [
      "incorrect property"
    ]
  },
  {
    "id": "q185",
    "question": "Give me all breeds of the German Shepherd dog.",
    "sparql_wrong": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/property/species> <http://dbpedia.org/resource/German_Shepherd> }",
    "sparql_gold": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/property/breed> <http://dbpedia.org/resource/German_Shepherd> }",
    "error_types": [
      "semantic"
    ],
    "sub_error_types": [
      "incorrect property"
    ]
  },
  {
    "id": "q193",
    "question": "Is Cola a beverage?",
    "sparql_wrong": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> ASK WHERE { res:Cola rdf:type dbo:Automobile }",
    "sparql_gold": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> ASK WHERE { res:Cola rdf:type dbo:Beverage }",
    "error_types": [
      "semantic"
    ],
    "sub_error_types": [
      "incorrect class"
    ]
  },
  {
    "id": "q210",
    "question": "Who created Batman?",
    "sparql_wrong": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:creator res:Batman }",
    "sparql_gold": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Batman dbo:creator ?uri }",
    "error_types": [
      "structural"
    ],
    "sub_error_types": [
      "triple flip (subject/object inversion)"
    ]
  },
  {
    "id": "q213",
    "question": "Give me all movies directed by Francis Ford Coppola.",
    "sparql_wrong": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Film ; dbo:producer res:Francis_Ford_Coppola }",
    "sparql_gold": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Film ; dbo:director res:Francis_Ford_Coppola }",
    "error_types": [
      "semantic"
    ],
    "sub_error_types": [
      "incorrect property"
    ]
  },
  {
    "id": "q231",
    "question": "Give me all launch pads operated by NASA.",
    "sparql_wrong": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:SpaceStation ; dbo:operator res:NASA }",
    "sparql_gold": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:LaunchPad ; dbo:operator res:NASA }",
    "error_types": [
      "semantic"
    ],
    "sub_error_types": [
      "incorrect class"
    ]
  },
  {
    "id": "q249",
    "question": "List all the musicals with music by Elton John.",
    "sparql_wrong": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Musical ; dbo:musicBy res:Elton_John_Smith }",
    "sparql_gold": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Musical ; dbo:musicBy res:Elton_John }",
    "error_types": [
      "semantic"
    ],
    "sub_error_types": [
      "hallucinated entity or property"
    ]
  },
  {
    "id": "q260",
    "question": "Give me the runtime of Toy Story.",
    "sparql_wrong": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?runtime WHERE { res:Toy_Story dbo:releaseDate ?runtime }",
    "sparql_gold": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?runtime WHERE { res:Toy_Story dbo:runtime ?runtime }",
    "error_types": [
      "semantic"
    ],
    "sub_error_types": [
      "incorrect property"
    ]
  },
  {
    "id": "q275",
    "question": "List the children of Margaret Thatcher.",
    "sparql_wrong": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Margaret_Thatcher dbo:parent ?uri }",
    "sparql_gold": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Margaret_Thatcher dbo:child ?uri }",
    "error_types": [
      "semantic"
    ],
    "sub_error_types": [
      "incorrect property"
    ]
  },
  {
    "id": "q286",
    "question": "Give me all actors starring in movies directed by William Shatner.",
    "sparql_wrong": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?x dbo:director res:William_Shatner . ?uri dbo:starring ?x }",
    "sparql_gold": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?x dbo:director res:William_Shatner ; dbo:starring ?uri }",
    "error_types": [
      "structural"
    ],
    "sub_error_types": [
      "triple flip (subject/object inversion)"
    ]
  },
  {
    "id": "q290",
    "question": "List all games by GMT.",
    "sparql_wrong": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:publisher res:GMT_Games }",
    "sparql_gold": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:publisher res:GMT_Games }",
    "error_types": [
      "syntax"
    ],
    "sub_error_types": [
      "missing or mismatched braces"
    ]
  },
  {
    "id": "q295",
    "question": "Give me all video games published by Mean Hamster Software.",
    "sparql_wrong": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:VideoGame ; dbo:developer res:Mean_Hamster_Software }",
    "sparql_gold": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:VideoGame ; dbo:publisher res:Mean_Hamster_Software }",
    "error_types": [
      "semantic"
    ],
    "sub_error_types": [
      "incorrect property"
    ]
  },
  {
    "id": "q296",
    "question": "Give me all members of Prodigy.",
    "sparql_wrong": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:The_Prodigy dbo:author ?uri }",
    "sparql_gold": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:The_Prodigy dbo:bandMember ?uri }",
    "error_types": [
      "semantic"
    ],
    "sub_error_types": [
      "incorrect property"
    ]
  },
  {
    "id": "q313",
    "question": "Give me the birth place of Frank Sinatra.",
    "sparql_wrong": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?place WHERE { res:Frank_Sinatra dbo:deathPlace ?place }",
    "sparql_gold": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?place WHERE { res:Frank_Sinatra dbo:birthPlace ?place }",
    "error_types": [
      "semantic"
    ],
    "sub_error_types": [
      "incorrect property"
    ]
  },
  {
    "id": "q347",
    "question": "Show me all books in Asimov's Foundation series.",
    "sparql_wrong": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:series res:Foundation_series }",
    "sparql_gold": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:series res:Foundation_series }",
    "error_types": [
      "syntax"
    ],
    "sub_error_types": [
      "missing or mismatched braces"
    ]
  },
  {
    "id": "q367",
    "question": "Give me the grandchildren of Elvis Presley.",
    "sparql_wrong": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Elvis_Presley dbo:parent ?child . ?child dbo:child ?uri }",
    "sparql_gold": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Elvis_Presley dbo:child ?child . ?child dbo:child ?uri }",
    "error_types": [
      "semantic"
    ],
    "sub_error_types": [
      "incorrect property"
    ]
  },
  {
    "id": "q371",
    "question": "Give me all books by William Goldman with more than 300 pages.",
    "sparql_wrong": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Film ; dbo:author res:William_Goldman ; dbo:numberOfPages ?x FILTER ( ?x > 300 ) }",
    "sparql_gold": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Book ; dbo:author res:William_Goldman ; dbo:numberOfPages ?x FILTER ( ?x > 300 ) }",
    "error_types": [
      "semantic"
    ],
    "sub_error_types": [
      "incorrect class"
    ]
  },
  {
    "id": "q383",
    "question": "Show me the book that Muhammad Ali wrote.",
    "sparql_wrong": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Book ; dbo:author res:Mike_Tyson }",
    "sparql_gold": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Book ; dbo:author res:Muhammad_Ali }",
    "error_types": [
      "semantic"
    ],
    "sub_error_types": [
      "wrong literal or resource type"
    ]
  }
]