[
  {
    "id": "q391",
    "question": "Show me Hemingway's autobiography.",
    "sparql_wrong": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:author res:Ernest_Hemingway ; dbo:literaryGenre res:Biography }",
    "sparql_gold": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:author res:Ernest_Hemingway ; dbo:literaryGenre res:Autobiography }",
    "error_types": [
      "semantic"
    ],
    "sub_error_types": [
      "wrong literal or resource type"
    ]
  },
  {
    "id": "q394",
    "question": "Give me all Canadian Grunge record labels.",
    "sparql_wrong": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:RecordLabel ; dbo:genre res:Jazz ; dbo:country res:Canada }",
    "sparql_gold": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:RecordLabel ; dbo:genre res:Grunge ; dbo:country res:Canada }",
    "error_types": [
      "semantic"
    ],
    "sub_error_types": [
      "wrong literal or resource type"
    ]
  },
  {
    "id": "q402",
    "question": "Give me the currency of China.",
    "sparql_wrong": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:currency res:China }",
    "sparql_gold": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:China dbo:currency ?uri }",
    "error_types": [
      "structural"
    ],
    "sub_error_types": [
      "triple flip (subject/object inversion)"
    ]
  },
  {
    "id": "q403",
    "question": "Give me all Swedish oceanographers.",
    "sparql_wrong": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:field res:Oceanography ; dbo:birthPlace res:Norway }",
    "sparql_gold": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:field res:Oceanography ; dbo:birthPlace res:Sweden }",
    "error_types": [
      "semantic"
    ],
    "sub_error_types": [
      "wrong literal or resource type"
    ]
  },
  {
    "id": "q412",
    "question": "Give me all actors starring in Last Action Hero.",
    "sparql_wrong": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Last_Action_Hero dbo:starring ?uri ",
    "sparql_gold": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Last_Action_Hero dbo:starring ?uri }",
    "error_types": [
      "syntax"
    ],
    "sub_error_types": [
      "missing or mismatched braces"
    ]
  }
]